k6/complex/smoke.log
          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (11.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s

     ✓ find paths

     checks.........................: 100.00% ✓ 10       ✗ 0
     data_received..................: 25 kB   2.2 kB/s
     data_sent......................: 1.0 kB  93 B/s
     http_req_blocked...............: avg=1.88ms   min=2.8µs   med=2.85µs  max=18.86ms  p(90)=1.88ms   p(95)=10.37ms
     http_req_connecting............: avg=47.45µs  min=0s      med=0s      max=474.59µs p(90)=47.45µs  p(95)=261.02µs
   ✓ http_req_duration..............: avg=94.62ms  min=90.89ms med=94.8ms  max=101.69ms p(90)=97.08ms  p(95)=99.38ms
       { expected_response:true }...: avg=94.62ms  min=90.89ms med=94.8ms  max=101.69ms p(90)=97.08ms  p(95)=99.38ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 10
     http_req_receiving.............: avg=177.14µs min=59.44µs med=68.6µs  max=1.15ms   p(90)=184.45µs p(95)=670.7µs
     http_req_sending...............: avg=85.48µs  min=62.44µs med=76.99µs max=174.2µs  p(90)=95.64µs  p(95)=134.92µs
     http_req_tls_handshaking.......: avg=1.53ms   min=0s      med=0s      max=15.36ms  p(90)=1.53ms   p(95)=8.44ms
     http_req_waiting...............: avg=94.36ms  min=90.09ms med=94.65ms max=101.44ms p(90)=96.94ms  p(95)=99.19ms
     http_reqs......................: 10      0.911055/s
     iteration_duration.............: avg=1.09s    min=1.09s   med=1.09s   max=1.12s    p(90)=1.09s    p(95)=1.11s
     iterations.....................: 10      0.911055/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1